import math

def area(r):
    return math.pi * r * r
    '''
    Функция принимает значение r, возвращает площадь окружнсти.
        Параметры: r(int) - десятичное число.
        Пример:
            Принимает: r = 2
            Возвращает: 12.56
    '''

def perimeter(r):
    return 2 * math.pi * r
    '''
    Функция принимает значение r, возвращает периметр окружнсти.
        Параметры: r(int) - десятичное число.
        Пример:
            Принимает: r = 2
            Возвращает: 12.56
    '''
