def area(a, b):
    '''
    Принимает значения a, b - длины сторон прямоугольника

        Параметры:
            a (int) или (float): в зависимости от введного значения
            b (int) или (float): в зависимости от введного значения

        Возвращаемое значение:
            Площадь прямоугольника (int) или (float)
    '''
    return a * b 

def perimeter(a, b):
    '''
    Принимает значения a, b - длины сторон прямоугольника

        Параметры:
            a (int) или (float): в зависимости от введного значения
            b (int) или (float): в зависимости от введного значения

        Возвращаемое значение:
            Периметр прямоугольника (int) или (float)
    '''
    return (a + b) * 2