def area(a, b):
    '''
    Возвращает значение площади прямоугольника с заданными сторонами

            Параметры:
                    a (числовой тип): первая сторона прямоугольника
                    b (числовой тип): вторая сторона прямоугольника

            Возвращаемое значение:
                    area (числовой тип): площадь прямоугольника
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает значение периметра прямоугольника с заданными сторонами

            Параметры:
                    a (числовой тип): первая сторона прямоугольника
                    b (числовой тип): вторая сторона прямоугольника
            
            Возвращаемое значение:
                    perimeter (числовой тип): периметр прямоугольника
                    
    '''
    return 2 * (a + b)