'''
Принимает значения a,b, возращает значение площади прямоугольника
    Параметры:
            a (int): первое десятичное число
	    b (int): второе десятичное число
    Пример:
            Получает: a=5, b=20
            Возвращает: 100
'''
def area(a, b):
	return a * b


'''
Принимает значения a,b, возращает значение периметра прямоугольника
    Параметры:
            a (int): первое десятичное число
	    b (int): второе десятичное число
    Пример:
            Получает: a=5, b=20
            Возвращает: 50
'''
def perimeter(a, b):
	return (a + b)*2
