'''
Функция для нахождения площади прямоугольника по заданным параметрам a и b
'''

def area(a, b):
    '''
    Возвращает произведение двух чисел

        Параметры:

            a(int): длинна прямоугольника
            b(int): ширина прямоугольника

        Вовзвращаемое значение:
        
            area(int): произведение чисел a и b
    '''
    return a * b

'''
Функция для нахождения периметра прямоугольника по заданным парметрам a и b
'''

def perimeter(a, b):
    '''
    Возвращает удвоенную сумму параметров a и b

        Параметры:

            a(int): длинна прямоугольника
            b(int): ширина прямоугольника

        Возвращаемое значение:

            perimeter(int): удвоенная сумма параметров a и b
    '''
    return 2*a + 2*b
