def area(a, b): 
    '''
    Принимает длины сторон, возвращает площадь прямоугольника с такими сторонами
		Параметры:
			a (int): длина стороны
			b (int): длина стороны
		Возвращаемое значение:
			s (int): площадь прямоугольника
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Принимает длины сторон, возвращает периметр прямоугольника с такими сторонами
		Параметры:
			a (int): длина стороны
			b (int): длина стороны
		Возвращаемое значение:
			p (int): периметр прямоугольника
    '''
    return (a + b)*2 



