def area(a, b):
    '''
    Возвращает площадь прямоугольника.
            Параметры:
                    a (int): Ширина прямоугольника
                    b (int): Высота прямоугольника
            Возвращаемое значение:
                    area (int): Результат умножения чисел a и b
    '''
    return a * b


def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника.
            Параметры:
                    a (int): Ширина прямоугольника
                    b (int): Высота прямоугольника
            Возвращаемое значение:
                    perimeter (int): Результат сложения чисел a и b и умножения их на 2
        '''
    return (a + b)*2