def area(a, b):
    '''
        Принимает два числа, значение a - сторона прямоугольника, b - сторона прямоугольника

          Параметры:
              a (int) или (float)
              b (int) или (float)

          Возвращаемое значение:
            Площадь прямоугольника (int) или (float)
        '''
    return a * b

def perimeter(a, b):
    '''
        Принимает два числа, значение a - сторона прямоугольника, b - сторона прямоугольника

          Параметры:
              a (int) или (float)
              b (int) или (float)

          Возвращаемое значение:
            Периметр прямоугольника (int) или (float)
        '''
    return (a + b) * 2
