def area(a, b):
    return a * b
    '''
    Функция принимает значения a и b, возвращает площадь прямоугольника.
        Параметры: a(int) - десятичное число.
                   b(int) - десятичное число.
        Пример:
            Принимает: a = 3, b = 4
            Возвращает: 12
    '''
    //
def perimeter(a, b):
    return 2*(a + b)
    '''
    Функция принимает значения a и b, возвращает периметр прямоугольника.
        Параметры: a(int) - десятичное число.
                   b(int) - десятичное число.
        Пример:
            Принимает: a = 3, b = 4
            Возвращает: 14
    '''
