def area(a, b):
    '''
    Возвращает площадь прямоугольника с передаваемыми сторонами.

                Параметры:
                        a (float): длина прямоугольника
                        b (float): ширина прямоугольника

                Возвращаемое значение:
                        a * b (float): площадь прямоугольника
    '''
    return a * b

def perimeter(a, b):
    '''
        Возвращает периметр прямоугольника с передаваемыми сторонами.

                    Параметры:
                            a (float): длина прямоугольника
                            b (float): ширина прямоугольника

                    Возвращаемое значение:
                            2 * (a + b) (float): периметр прямоугольника
        '''
    return 2 * (a + b)
