def area(a, b):
    '''
       Возвращает площадь прямоугольника

           Параметры:
               a (int): одна из сторон прямоугольника
               b (int): вторая сторона прямоугольника

           Возвращаемое значение:
               a*b (int): произведение двух сторон
    '''
    return a * b

def perimeter(a, b):
    '''
        Возвращает периметр прямоугольника

            Параметры:
               a (int): одна из сторон прямоугольника
               b (int): вторая сторона прямоугольника

            Возвращаемое значение:
                (a + b)*2 (int): удвоенная сумма сторон
    '''
    
    return (a + b)*2
