def area(a, b):
    '''
      Возвращает площадь прямоугольника
      
      Параметры: 
			a(int): первая сторона прямоугольника (длина)
			b(int): вторая сторона треугольника (ширина)
      Возвращаемое значение:
			area(a, b): площадь прямоугольника
    '''
    return a * b


def perimeter(a, b):
    '''
      Возвращает периметр прямоугольника
      
      Параметры: 
			a(int): первая сторона прямоугольника (длина)
			b(int): вторая сторона треугольника (ширина)
      Возвращаемое значение:
			perimetr(a, b): периметр прямоугольника
    '''
    return (a + b)*2
