def area(a, b):
    '''
    Данная фунция возвращает площадь прямоугольника.

        Параметры:
            a (int) : первая сторона прямоугольника
            b (int) : вторая сторона прямоугольника

        Возвращаемое значение:
            a * b (int) : площадь прямоугольника
    '''
    return a * b 

def perimeter(a, b):
    '''
        Данная фунция возвращает периметр прямоугольника.

            Параметры:
                a (int) : первая сторона прямоугольника
                b (int) : вторая сторона прямоугольника

            Возвращаемое значение:
                2 * (a + b) : периметр прямоугольника
        '''
    return 2 * (a + b) 