
def area(a, b):
     '''
    Возвращает площадь прямоугольника

        Параметры:
            a (int): сторона прямоугольика
            b (int): сторона прямоугольника
        Возвращаемое значение:
            a*b (площадь прямоугольника)
    
    '''
     return a * b 

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника

        Параметры:
            a (int): сторона прямоугольика
            b (int): сторона прямоугольника
        Возвращаемое значение:
            удвоенная сумма a и b (периметр прямоугольника)
    
    '''
     return (a + b)*2
