
def area(a):
    '''
    Данная фунция возвращает площадь квадарата.

        Параметры:
            a (int) : сторона квадрата

        Возвращаемое значение:
            a * a (int) : площадь квадарата
    '''
    return a * a


def perimeter(a):
    '''
    Данная фунция возвращает периметр квадарата.

                Параметры:
                    a (int) : сторона квадрата

                Возвращаемое значение:
                    4 * a (int) : периметр квадарата
    '''
    return 4 * a
