import unittest
def area(a):
    '''
    Возвращает площадь квадрата со стороной a (число)

        Параметры:
            a - длина стороны (число)

        Возвращаемое значение:
            Произведение  a * a, то есть плозодь квадрата
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со длиной стороны a (число)

        Параметры:
            a - длина стороны (число)

        Возвращаемое значение:
            произведение а на 4, то есть периметр квадрата.
    '''
    return 4 * a

