
def area(a):
    '''
        Возвращает площадь квадрата с передаваемой стороной.

                    Параметры:
                            a (float): сторона квадрата

                    Возвращаемое значение:
                            a * b (float): площадь квадрата
        '''
    return a * a


def perimeter(a):
    '''
        Возвращает периметр квадрата с передаваемой стороной.

                    Параметры:
                            a (float): сторона квадрата

                    Возвращаемое значение:
                            4 * a (float): периметр квадрата
        '''
    return 4 * a
