def area(a):
    '''
    Возвращает площадь квадрата.
            Параметры:
                    a (int): Ширина(высота) квадрата
            Возвращаемое значение:
                    area (int): Результат умножения чисел a и a
    '''
    return a * a

def perimeter(a):
    '''
    Возвращает периметр квадрата.
            Параметры:
                    a (int): Ширина(высота) квадрата
            Возвращаемое значение:
                    perimeter (int): Результат умножения стороны на 4
    '''
    return 4 * a
