
def area(a):
    '''
        Возвращает площадь квадрата со стороной а.

            Параметры:
                а(int): сторона квадрата

            Возвращаемое значение:
                a*a(int): площадь квадрата
    '''
    return a * a


def perimeter(a):
    '''
        Возвращает периметр квадрата со стороной a.
        
            Параметры:
                a(int): сторона квадрата.

            Возвращаемое значение:
                4*а(int): периметр квадрата.
    '''
    return 4 * a
