
def area(a):
    ''' Высчитывается площадь квадрата с стороной a
            Агрумент a (int) равен стороне квадрата

            Возвращаемое значение area(a): (int)
                Площадь квадрата с стороной a
        Пример запуска:
        area(3)
        >> 9
    '''
    return a * a


def perimeter(a):
    ''' Высчитывается площадь квадрата с стороной a
            Агрумент a (int) равен стороне квадрата
            Возвращаемое значение perimeter(a): (int)
                Периметр квадрата с стороной а
        Пример запуска:
        perimeter(3)
        >> 12
    '''
    return 4 * a
