def area(a):
    '''
    Принимает значения a - длинa стороны квадрата

        Параметры:
            a (int) или (float): в зависимости от введного значения

        Возвращаемое значение:
            Площадь квадарта (int) или (float)
    '''
    return a * a


def perimeter(a):
    '''
    Принимает значения a - длинa стороны квадрата

        Параметры:
            a (int) или (float): в зависимости от введного значения

        Возвращаемое значение:
            Периметр квадарта (int) или (float)
    '''
    return 4 * a
