
def area(a):
    '''
    Принимает сторону квадрата, возврашает площадь квадрата.

        Параметры:
            a (int): сторона квадрата

        Возвращаемое значение:
            a * a (int): площадь квадрата со стороной a
    '''
    return a * a


def perimeter(a):
    '''
    Принимает сторону квадрата, возврашает периметр квадрата.

        Параметры:
            a (int): сторона квадрата

        Возвращаемое значение:
            4 * a (int): периметр квадрата со стороной a
    '''
    return 4 * a
