
def area(a):
    '''
    Вычислияет значение площади квадрата с заданной стороной

            Параметры:
                    a (числовой тип): длина стороны квадрата

            Возвращаемое значение:
                    area (числовой тип): площадь квадрата
    '''
    return a * a


def perimeter(a):
    '''
    Вычислияет значение периметра квадрата с заданной стороной

            Параметры:
                    а (числовой тип): длина стороны квадрата

            Возвращаемое значение:
                    perimeter (числовой тип): периметр квадрата
    '''
    return 4 * a
