
def area(a):
    '''
    Возвращает значение площади квадрата с заданной стороной

            Параметры:
                    a (числовой тип): длина стороны квадрата

            Возвращаемое значение:
                    area (числовой тип): значение площади квадрата
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает значение периметра квадрата с заданной стороной

            Параметры:
                    а (числовой тип): длина стороны квадрата

            Возвращаемое значение:
                    perimeter (числовой тип): значение периметра квадрата
    '''
    return 4 * a
