def area(a, h):
    '''
    Возвращает произведение двух чисел разделенное на два.
    :param a: первое десятичное число.
    :param h: второе десятчное число.
    :return: число, состоящее из произведения a и b, разделенного на 2.
    '''
    return a * h / 2 

def perimeter(a, b, c):
    '''
    Возвращает сумму трех чисел.
    :param a: первое десятичное число.
    :param b: второе десятичное число.
    :param c: третье десятичное число.
    :return: число, состоящее из суммы чисел a, b и c.
    '''
    return a + b + c 