def area(a, h):
    '''
    Данная фунция возвращает площадь треугольника.

        Параметры:
            a (int) : основание треугольника
            h (int) : высота треугольника проведенная к стороне

        Возвращаемое значение:
            a * h / 2 (int) : площадь треугольника
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''
    Данная фунция возвращает периметр треугольника.

        Параметры:
            a (int) : основание треугольника
            h (int) : высота треугольника проведенная к стороне

        Возвращаемое значение:
            a + b + c (int) : периметр треугольника
        '''
    return a + b + c 