def area(a, h): 
    '''
    Принимает длину стороны и высоту, возвращает площадь соответствующего треугольнтка
		Параметры:
			a (int): длина стороны
			h (int): высота
		Возвращаемое значение:
			s (int): площадь треугольника
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Принимает длины сторон возвращает периметр соответствующего треугольнтка
		Параметры:
			a (int): длина стороны
			b (int): длина стороны
			c (int): длина стороны
		Возвращаемое значение:
			p (int): периметр треугольника
    '''
    return a + b + c 