'''
Принимает значение a,h, возращает значение площади треугольника
    Параметры:
            a (int): первое десятичное число
	    h (int): второе десятичное число

    Пример:
            Получает: a=4, h=10
            Возвращает: 20
'''
def area(a, h):
	return a * h / 2


'''
Принимает значение a,b,c,  возращает значение периметра треугольника
    Параметры:
            a (int): первое десятичное число
	    b (int): второе десятичное число
            c (int): третье десятичное число


    Пример:
            Получает: a=4, b=3, c=5
            Возвращает: 12
'''
def perimeter(a, b, c):
	return a + b + c
