def area (a,h):
    '''
    На вход поступает два числа:
            a (int): длина стороны треугольника
            h (int): длина высоты треугольника
    Функция возвращает произведение  a и h деленное на 2.
    '''
    return a * h/2

def perimetr(a,b,c):
    '''
    На вход поступает три числа:
            a (int): длина стороны треугольника
            b (int): длина стороны треугольника
            c (int): длина стороны треугольника
    Функция возвращает сумму сторон треугольника.
    '''
    return a + b + c
