def area(a, h):
    '''
    Возвращает площадь треугольника

        Параметры:
            a (int): сторона треугольника, на которую опущена высота
            h (int): высота треугольника
            
        Возвращаемое значение:
            сторона, умноженная на высоту и все это деленное на 2
    
    '''
    return a * h / 2 

def perimeter(a, b, c):
     '''
    Возвращает периметр треугольника

        Параметры:
            a (int): первая сторона треугольника
            b (int): вторая сторона треугольника
            c (int): третья сторона треугольника
            
        Возвращаемое значение:
            периметр треугольника (сумма длин всех его сторон)
    
    '''
    
     return a + b + c 
