def area(a, h):
    '''
    Принимает два числа, значение a - сторона треугольника, h - высота треугольника

      Параметры:
          a (int) или (float)
          h (int) или (float)

      Возвращаемое значение:
        Площадь треугольника (int) или (float)
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
    Принимает три числа: a, b, c - стороны треугольника

      Параметры:
        a (int) или (float)
        b (int) или (float)
        с (int) или (float)

        Возвращаемое значение:
         Параметр треугольника (int) или (float)
    '''
    return a + b + c