def area(a, h):
    '''
    Возвращает площадь треугольника.
            Параметры:
                    a (int): Основние треугольника
                    h (int): Высота треугольника
            Возвращаемое значение:
                    area (int): Результат умножения чисел a и b и деления их на 2
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника.
            Параметры:
                    a (int): Сторона треугольника
                    b (int): Сторона треугольника
                    с (int): Сторона треугольника
            Возвращаемое значение:
                    perimeter (int): Результат сложения чисел a, b, c
    '''
    return a + b + c