def area(a, h):
    return a * h / 2
    '''
    Функция принимает значения a и h, возвращает площадь треугольника.
        Параметры: a(int) - десятичное число.
                   h(int) - десятичное число.
        Пример:
            Принимает: a = 3, h = 4
            Возвращает: 6 
    '''
    
def perimeter(a, b, c):
    return a + b + c
    '''
    Функция принимает значения a, b и c, возвращает периметр треугольника.
        Параметры: a(int) - десятичное число.
                   b(int) - десятичное число.
                   c(int) - десятичное число.
        Пример:
            Принимает: a = 3, b = 4, c = 5
            Возвращает: 12
    '''
