def area(a, h):
    '''
    Принимает значения a, h - длины сторон треугольника

        Параметры:
            a (int) или (float): в зависимости от введного значения
            h (int) или (float): в зависимости от введного значения

        Возвращаемое значение:
            Площадь треугольника (int) или (float)
    '''
    return a * h / 2 

def perimeter(a, b, c):
    '''
      Принимает значения a, b, c - длины сторон треугольника

          Параметры:
              a (int) или (float): в зависимости от введного значения
              b (int) или (float): в зависимости от введного значения
              c (int) или (float): в зависимости от введного значения

          Возвращаемое значение:
              Периметр треугольника (int) или (float)
      '''
    return a + b + c